OpenFOAM-v2112/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorCouette/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel univariate;

univariateCoeffs
{
    aggregation on;
    aggregationKernel
    {
        aggregationKernel turbulentBrownian;
    }

    breakup on;
    breakupKernel
    {
        breakupKernel LuoSvendsen;

        Cb        Cb        [ 0 0 0 0 0 0 0 ] 1.0e-3;
        epsilonExp          0.75;
        nuExp              -1.25;
        sizeExp             1.0;

        daughterDistribution
        {
            daughterDistribution symmetricFragmentation;
        }
    }

    diffusionModel
    {
        diffusionModel  turbulentDiffusion;
        gammaLam        gammaLam    [ 0 2 -1 0 0 0 0 ] 1.0e-6;
        Sc              0.7;
    }

    growth off;
    growthModel
    {
        growthModel	constant;
        minAbscissa     0.0;
        maxAbscissa     1.0;

        Cg        Cg        [0 0 -1 0 0 0 0 ] 1.0;
    }

    nucleationModel
    {
        nucleationModel  none;
    }

    odeCoeffs
    {
        ATol    1.0e-8;
        RTol    1.0e-4;
        fac     0.9;
        facMin  0.5;
        facMax  2.0;
        minLocalDt 1.0e-5;
    }
}


// ************************************************************************* //
